## Staging: load-balancer
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 9 to add, 1 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                       NAME                                        |
|--------|-----------------------------------------------------------------------------------|
| add    | `module.waf_ip_blocklist.aws_cloudwatch_event_rule.ipv4_blocklist`                |
|        | `module.waf_ip_blocklist.aws_cloudwatch_event_target.ipv4_blocklist`              |
|        | `module.waf_ip_blocklist.aws_cloudwatch_log_group.ipv4_blocklist`                 |
|        | `module.waf_ip_blocklist.aws_cloudwatch_log_metric_filter.ip_added_to_block_list` |
|        | `module.waf_ip_blocklist.aws_iam_policy.ipv4_blocklist`                           |
|        | `module.waf_ip_blocklist.aws_iam_role_policy_attachment.ipv4_blocklist`           |
|        | `module.waf_ip_blocklist.aws_lambda_function.ipv4_blocklist`                      |
|        | `module.waf_ip_blocklist.aws_lambda_permission.ipv4_blocklist`                    |
|        | `module.waf_ip_blocklist.aws_wafv2_ip_set.ipv4_blocklist`                         |
| update | `aws_wafv2_web_acl.wordpress_waf`                                                 |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # aws_wafv2_web_acl.wordpress_waf will be updated in-place
  ~ resource "aws_wafv2_web_acl" "wordpress_waf" {
        id                          = "d578506d-443d-45bc-afe7-182599e8d052"
        name                        = "wordpress_waf"
        tags                        = {
            "CostCentre" = "PlatformGCArticles"
        }
        # (10 unchanged attributes hidden)

      - rule {
          - name     = "WordpressRateLimit" -> null
          - priority = 110 -> null

          - action {
              - block {
                  - custom_response {
                      - response_code            = 429 -> null
                        # (1 unchanged attribute hidden)

                      - response_header {
                          - name  = "waf-block" -> null
                          - value = "RateLimit" -> null
                        }
                    }
                }
            }

          - statement {
              - rate_based_statement {
                  - aggregate_key_type    = "IP" -> null
                  - evaluation_window_sec = 300 -> null
                  - limit                 = 2000 -> null
                }
            }

          - visibility_config {
              - cloudwatch_metrics_enabled = true -> null
              - metric_name                = "WordpressRateLimit" -> null
              - sampled_requests_enabled   = true -> null
            }
        }
      - rule {
          - name     = "AWSManagedRulesAmazonIpReputationList" -> null
          - priority = 10 -> null

          - override_action {
              - none {}
            }

          - statement {
              - managed_rule_group_statement {
                  - name        = "AWSManagedRulesAmazonIpReputationList" -> null
                  - vendor_name = "AWS" -> null
                    # (1 unchanged attribute hidden)
                }
            }

          - visibility_config {
              - cloudwatch_metrics_enabled = true -> null
              - metric_name                = "AWSManagedRulesAmazonIpReputationList" -> null
              - sampled_requests_enabled   = true -> null
            }
        }
      - rule {
          - name     = "AWSManagedRulesKnownBadInputsRuleSet" -> null
          - priority = 2 -> null

          - override_action {
              - none {}
            }

          - statement {
              - managed_rule_group_statement {
                  - name        = "AWSManagedRulesKnownBadInputsRuleSet" -> null
                  - vendor_name = "AWS" -> null
                    # (1 unchanged attribute hidden)
                }
            }

          - visibility_config {
              - cloudwatch_metrics_enabled = true -> null
              - metric_name                = "AWSManagedRulesKnownBadInputsRuleSet" -> null
              - sampled_requests_enabled   = true -> null
            }
        }
      - rule {
          - name     = "AWSManagedRulesWordPressRuleSet" -> null
          - priority = 9 -> null

          - override_action {
              - none {}
            }

          - statement {
              - managed_rule_group_statement {
                  - name        = "AWSManagedRulesWordPressRuleSet" -> null
                  - vendor_name = "AWS" -> null
                    # (1 unchanged attribute hidden)
                }
            }

          - visibility_config {
              - cloudwatch_metrics_enabled = true -> null
              - metric_name                = "AWSManagedRulesWordPressRuleSet" -> null
              - sampled_requests_enabled   = true -> null
            }
        }
      + rule {
          + name     = "WordpressRateLimit"
          + priority = 110

          + action {
              + block {
                  + custom_response {
                      + response_code = 429

                      + response_header {
                          + name  = "waf-block"
                          + value = "RateLimit"
                        }
                    }
                }
            }

          + statement {
              + rate_based_statement {
                  + aggregate_key_type    = "IP"
                  + evaluation_window_sec = 300
                  + limit                 = 2000
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "WordpressRateLimit"
              + sampled_requests_enabled   = true
            }
        }
      + rule {
          + name     = "BlockedIPv4"
          + priority = 120

          + action {
              + count {
                }
            }

          + statement {
              + ip_set_reference_statement {
                  + arn = (known after apply)
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "BlockedIPv4"
              + sampled_requests_enabled   = true
            }
        }
      + rule {
          + name     = "AWSManagedRulesAmazonIpReputationList"
          + priority = 10

          + override_action {
              + none {}
            }

          + statement {
              + managed_rule_group_statement {
                  + name        = "AWSManagedRulesAmazonIpReputationList"
                  + vendor_name = "AWS"
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "AWSManagedRulesAmazonIpReputationList"
              + sampled_requests_enabled   = true
            }
        }
      + rule {
          + name     = "AWSManagedRulesKnownBadInputsRuleSet"
          + priority = 2

          + override_action {
              + none {}
            }

          + statement {
              + managed_rule_group_statement {
                  + name        = "AWSManagedRulesKnownBadInputsRuleSet"
                  + vendor_name = "AWS"
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "AWSManagedRulesKnownBadInputsRuleSet"
              + sampled_requests_enabled   = true
            }
        }
      + rule {
          + name     = "AWSManagedRulesWordPressRuleSet"
          + priority = 9

          + override_action {
              + none {}
            }

          + statement {
              + managed_rule_group_statement {
                  + name        = "AWSManagedRulesWordPressRuleSet"
                  + vendor_name = "AWS"
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "AWSManagedRulesWordPressRuleSet"
              + sampled_requests_enabled   = true
            }
        }

        # (13 unchanged blocks hidden)
    }

  # module.waf_ip_blocklist.data.aws_iam_policy_document.cloudwatch will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "cloudwatch" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
          + sid       = "CloudWatchWriteAccess"
        }
    }

  # module.waf_ip_blocklist.data.aws_iam_policy_document.combined will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "combined" {
      + id                      = (known after apply)
      + json                    = (known after apply)
      + minified_json           = (known after apply)
      + source_policy_documents = [
          + jsonencode(
                {
                  + Statement = [
                      + {
                          + Action   = [
                              + "athena:StartQueryExecution",
                              + "athena:GetQueryResults",
                              + "athena:GetQueryExecution",
                            ]
                          + Effect   = "Allow"
                          + Resource = "arn:aws:athena:us-east-1:729164266357:workgroup/logs"
                          + Sid      = "AthenaQueryAccess"
                        },
                      + {
                          + Action   = [
                              + "athena:ListTableMetadata",
                              + "athena:ListDatabases",
                              + "athena:GetTableMetadata",
                            ]
                          + Effect   = "Allow"
                          + Resource = [
                              + "arn:aws:athena:us-east-1:729164266357:catalog/AwsDataCatalog/database/access_logs/table/*",
                              + "arn:aws:athena:us-east-1:729164266357:catalog/AwsDataCatalog/database/access_logs",
                            ]
                          + Sid      = "AthenaReadAccess"
                        },
                      + {
                          + Action   = [
                              + "glue:GetTable",
                              + "glue:GetPartitions",
                              + "glue:GetDatabase",
                            ]
                          + Effect   = "Allow"
                          + Resource = [
                              + "arn:aws:glue:us-east-1:729164266357:table/access_logs/*",
                              + "arn:aws:glue:us-east-1:729164266357:database/access_logs",
                              + "arn:aws:glue:us-east-1:729164266357:catalog",
                            ]
                          + Sid      = "GlueReadAccess"
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            ),
          + (known after apply),
          + jsonencode(
                {
                  + Statement = [
                      + {
                          + Action   = [
                              + "s3:ListMultipartUploadParts",
                              + "s3:ListBucketMultipartUploads",
                              + "s3:ListBucket",
                              + "s3:GetObject",
                              + "s3:GetBucketLocation",
                              + "s3:AbortMultipartUpload",
                            ]
                          + Effect   = "Allow"
                          + Resource = [
                              + "arn:aws:s3:::gc-articles-staging-athena/*",
                              + "arn:aws:s3:::gc-articles-staging-athena",
                              + "arn:aws:s3:::cbs-satellite-729164266357/*",
                              + "arn:aws:s3:::cbs-satellite-729164266357",
                            ]
                          + Sid      = "S3ReadAccess"
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            ),
          + jsonencode(
                {
                  + Statement = [
                      + {
                          + Action   = "s3:PutObject"
                          + Effect   = "Allow"
                          + Resource = "arn:aws:s3:::gc-articles-staging-athena/*"
                          + Sid      = "S3WriteAccess"
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            ),
          + (known after apply),
        ]
    }

  # module.waf_ip_blocklist.data.aws_iam_policy_document.waf_ip_set will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "waf_ip_set" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "wafv2:GetIPSet",
              + "wafv2:UpdateIPSet",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
          + sid       = "WAFIPSetUpdate"
        }
    }

  # module.waf_ip_blocklist.aws_cloudwatch_event_rule.ipv4_blocklist will be created
  + resource "aws_cloudwatch_event_rule" "ipv4_blocklist" {
      + arn                 = (known after apply)
      + description         = "Update the IPv4 blocklist"
      + event_bus_name      = "default"
      + force_destroy       = false
      + id                  = (known after apply)
      + name                = "ipv4_blocklist_gc-articles"
      + name_prefix         = (known after apply)
      + schedule_expression = "rate(1 hour)"
      + tags                = {
          + "CostCentre" = "PlatformGCArticles"
          + "Terraform"  = "true"
        }
      + tags_all            = {
          + "CostCentre" = "PlatformGCArticles"
          + "Terraform"  = "true"
        }
    }

  # module.waf_ip_blocklist.aws_cloudwatch_event_target.ipv4_blocklist will be created
  + resource "aws_cloudwatch_event_target" "ipv4_blocklist" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + force_destroy  = false
      + id             = (known after apply)
      + rule           = (known after apply)
      + target_id      = (known after apply)
    }

  # module.waf_ip_blocklist.aws_cloudwatch_log_group.ipv4_blocklist will be created
  + resource "aws_cloudwatch_log_group" "ipv4_blocklist" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/ipv4_blocklist_gc-articles"
      + name_prefix       = (known after apply)
      + retention_in_days = 14
      + skip_destroy      = false
      + tags              = {
          + "CostCentre" = "PlatformGCArticles"
          + "Terraform"  = "true"
        }
      + tags_all          = {
          + "CostCentre" = "PlatformGCArticles"
          + "Terraform"  = "true"
        }
    }

  # module.waf_ip_blocklist.aws_cloudwatch_log_metric_filter.ip_added_to_block_list will be created
  + resource "aws_cloudwatch_log_metric_filter" "ip_added_to_block_list" {
      + id             = (known after apply)
      + log_group_name = "/aws/lambda/ipv4_blocklist_gc-articles"
      + name           = "IpAddedToBlockList"
      + pattern        = "\"[Metric] - New IP added to WAF IP Set\""

      + metric_transformation {
          + default_value = "0"
          + name          = "IpAddedToBlockList"
          + namespace     = "CDS_Platform"
          + unit          = "None"
          + value         = "1"
        }
    }

  # module.waf_ip_blocklist.aws_iam_policy.ipv4_blocklist will be created
  + resource "aws_iam_policy" "ipv4_blocklist" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "ipv4_blocklist_gc-articles"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags             = {
          + "CostCentre" = "PlatformGCArticles"
          + "Terraform"  = "true"
        }
      + tags_all         = {
          + "CostCentre" = "PlatformGCArticles"
          + "Terraform"  = "true"
        }
    }

  # module.waf_ip_blocklist.aws_iam_role_policy_attachment.ipv4_blocklist will be created
  + resource "aws_iam_role_policy_attachment" "ipv4_blocklist" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "ipv4_blocklist_gc-articles"
    }

  # module.waf_ip_blocklist.aws_lambda_function.ipv4_blocklist will be created
  + resource "aws_lambda_function" "ipv4_blocklist" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + description                    = "Update the IPv4 blocklist based on the WAF logs"
      + filename                       = "/tmp/blocklist.zip"
      + function_name                  = "ipv4_blocklist_gc-articles"
      + handler                        = "blocklist.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 1024
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::729164266357:role/ipv4_blocklist_gc-articles"
      + runtime                        = "python3.13"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "Rp0cbeLKZYKvfAKJSMnUm5QGU4ed0P+W7LOxTImMsF8="
      + source_code_size               = (known after apply)
      + tags                           = {
          + "CostCentre" = "PlatformGCArticles"
          + "Terraform"  = "true"
        }
      + tags_all                       = {
          + "CostCentre" = "PlatformGCArticles"
          + "Terraform"  = "true"
        }
      + timeout                        = 300
      + version                        = (known after apply)

      + environment {
          + variables = (known after apply)
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config {
          + mode = "Active"
        }
    }

  # module.waf_ip_blocklist.aws_lambda_permission.ipv4_blocklist will be created
  + resource "aws_lambda_permission" "ipv4_blocklist" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "ipv4_blocklist_gc-articles"
      + id                  = (known after apply)
      + principal           = "events.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowExecutionFromCloudWatch-ipv4_blocklist_gc-articles"
      + statement_id_prefix = (known after apply)
    }

  # module.waf_ip_blocklist.aws_wafv2_ip_set.ipv4_blocklist will be created
  + resource "aws_wafv2_ip_set" "ipv4_blocklist" {
      + arn                = (known after apply)
      + id                 = (known after apply)
      + ip_address_version = "IPV4"
      + lock_token         = (known after apply)
      + name               = "ipv4_blocklist_gc-articles"
      + name_prefix        = (known after apply)
      + scope              = "CLOUDFRONT"
      + tags               = {
          + "CostCentre" = "PlatformGCArticles"
          + "Terraform"  = "true"
        }
      + tags_all           = {
          + "CostCentre" = "PlatformGCArticles"
          + "Terraform"  = "true"
        }
    }

Plan: 9 to add, 1 to change, 0 to destroy.

Warning: Argument is deprecated

  with aws_s3_bucket.cloudfront_logs,
  on s3.tf line 4, in resource "aws_s3_bucket" "cloudfront_logs":
   4: resource "aws_s3_bucket" "cloudfront_logs" {

grant is deprecated. Use the aws_s3_bucket_acl resource instead.

(and 8 more similar warnings elsewhere)

Warning: Reference to undefined provider

  on waf.tf line 922, in module "waf_ip_blocklist":
 922:     aws = aws.us-east-1

There is no explicit declaration for local provider name "aws" in
module.waf_ip_blocklist, so Terraform is assuming you mean to pass a
configuration for "hashicorp/aws".

If you also control the child module, add a required_providers entry named
"aws" with the source address "hashicorp/aws".

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.wordpress"]
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.wordpress_cloudfront"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudfront_distribution.wordpress"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.cache_buster"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.firehose_waf_logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.firehose_waf_logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_user.cache_buster"]
WARN - plan.json - main - Missing Common Tags: ["aws_lb.wordpress"]
WARN - plan.json - main - Missing Common Tags: ["aws_lb_listener.wordpress"]
WARN - plan.json - main - Missing Common Tags: ["aws_lb_target_group.wordpress"]
WARN - plan.json - main - Missing Common Tags: ["aws_s3_bucket.cloudfront_logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_wafv2_web_acl.wordpress_waf"]
WARN - plan.json - main - Missing Common Tags: ["aws_wafv2_web_acl.wordpress_waf_alb"]

32 tests, 19 passed, 13 warnings, 0 failures, 0 exceptions

```

</details>
